Revit 2027 API
ParameterTypeId.ProjectedSurfaceArea Property
 "Projected Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProjectedSurfaceArea { get; }
Public Shared ReadOnly Property ProjectedSurfaceArea As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProjectedSurfaceArea {
	ForgeTypeId^ get ();
}
static member ProjectedSurfaceArea : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace